Revit 2018 API
DocumentEntryPoint Members
The DocumentEntryPoint type exposes the following members.
Constructors
Name | Description
DocumentEntryPoint
Initializes a new instance of the DocumentEntryPoint class
Methods
Name | Description
AcquireCoordinates |  (Inherited from Document.)
AutoJoinElements
Forces the elements in the Revit document to automatically join to their neighbors where appropriate.
 (Inherited from Document.)
CanEnableWorksharing
 Checks if worksharing can be enabled in the document.
 (Inherited from Document.)
Close()
Closes the document, save the changes if there are.
 (Inherited from Document.)
Close(Boolean)
Closes the document with the option to save.
 (Inherited from Document.)
CombineElements
Combine a set of combinable elements into a geometry combination.
 (Inherited from Document.)
ConvertDetailToModelCurves
Converts a group of DetailCurves to equivalent ModelCurves.
 (Inherited from Document.)
ConvertModelToDetailCurves
Converts a group of ModelCurves to equivalent DetailCurves.
 (Inherited from Document.)
ConvertModelToSymbolicCurves
Converts a group of ModelCurves to equivalent SymbolicCurves.
 (Inherited from Document.)
ConvertSymbolicToModelCurves
Converts a group of SymbolicCurves to equivalent ModelCurves.
 (Inherited from Document.)
Delete(ElementId)
 Deletes an element from the document given the id of that element.
 (Inherited from Document.)
Delete(ICollection<ElementId>)
 Deletes a set of elements from the document.
 (Inherited from Document.)
Dispose |  (Inherited from Document.)
EditFamily
Gets the document of a loaded family to edit.
 (Inherited from Document.)
EnableWorksharing
 Enables worksharing in the document.
 (Inherited from Document.)
Equals
 Determines whether the specified Object equals to this Object.
 (Inherited from Document.)
Export(String, String, MassGBXMLExportOptions)
 Exports a gbXML file from a mass model document.
 (Inherited from Document.)
Export(String, String, GBXMLExportOptions)
 Export the model in gbXML (green-building) format.
 (Inherited from Document.)
Export(String, String, IFCExportOptions)
 Exports the document to the Industry Standard Classes (IFC) format.
 (Inherited from Document.)
Export(String, String, NavisworksExportOptions)
 Exports a Revit project to the Navisworks .nwc format.
 (Inherited from Document.)
Export(String, String, ViewSet, DWFExportOptions)
Exports the current view or a selection of views in DWF format.
 (Inherited from Document.)
Export(String, String, ViewSet, DWFXExportOptions)
Exports the current view or a selection of views in DWFX format.
 (Inherited from Document.)
Export(String, String, ViewSet, FBXExportOptions)
Exports the document in 3D-Studio Max (FBX) format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, DGNExportOptions)
 Exports a selection of views in DGN format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, DWGExportOptions)
 Exports a selection of views in DWG format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, DXFExportOptions)
 Exports a selection of views in DXF format.
 (Inherited from Document.)
Export(String, String, ICollection<ElementId>, SATExportOptions)
 Exports the current view or a selection of views in SAT format.
 (Inherited from Document.)
Export(String, String, View3D, ViewPlan, BuildingSiteExportOptions)
Exports the document in the format of Civil Engineering design applications.
 (Inherited from Document.)
ExportImage
 Exports a view or set of views into an image file.
 (Inherited from Document.)
FinishInitializationEO
 For Revit Macros internal use only.
GetDefaultElementTypeId
 Gets the default element type id with the given DefaultElementType id.
 (Inherited from Document.)
GetDefaultFamilyTypeId
 Gets the default family type id with the given family category id.
 (Inherited from Document.)
GetDocumentPreviewSettings
 Returns the preview settings for the given document.
 (Inherited from Document.)
GetElement(String)
 Gets the Element referenced by a unique id string.
 (Inherited from Document.)
GetElement(ElementId)
 Gets the Element referenced by the input string name.
 (Inherited from Document.)
GetElement(Reference)
 Gets the Element referenced by the input reference.
 (Inherited from Document.)
GetHashCode
 Gets the hash code of this document instance.
 (Inherited from Document.)
GetPaintedMaterial
 Get the material painted on the element's face. Returns invalidElementId if the face is not painted.
 (Inherited from Document.)
GetPrintSettingIds
 Retrieves all Print Settings of current project.
 (Inherited from Document.)
GetRoomAtPoint(XYZ)
Gets a room containing the point.
 (Inherited from Document.)
GetRoomAtPoint(XYZ, Phase)
Gets a room containing the point.
 (Inherited from Document.)
GetSpaceAtPoint(XYZ)
Gets a space containing the point.
 (Inherited from Document.)
GetSpaceAtPoint(XYZ, Phase)
Gets a space containing the point.
 (Inherited from Document.)
GetSubelement(String)
 Gets the subelement referenced by a unique id string.
 (Inherited from Document.)
GetSubelement(Reference)
 Gets the subelement referenced by the input reference.
 (Inherited from Document.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetUnits
 Gets the Units object.
 (Inherited from Document.)
GetWarnings
 Returns list of failure messages generated from persistent (reviewable) warnings accumulated in the document.
 (Inherited from Document.)
GetWorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Document.)
GetWorksetTable
 Get the WorksetTable of this document.
 (Inherited from Document.)
GetWorksharingCentralModelPath
 Gets the central model path of the worksharing model.
 (Inherited from Document.)
HasAllChangesFromCentral
 Returns whether the model in the current session is up to date with central.
 (Inherited from Document.)
Import(String, GBXMLImportOptions)
Imports a Green-Building XML file into the document.
 (Inherited from Document.)
Import(String, SATImportOptions, View)
 Imports an SAT file into the document.
 (Inherited from Document.)
Import(String, SKPImportOptions, View)
 Imports an SKP file into the document.
 (Inherited from Document.)
Import(String, DGNImportOptions, View, ElementId)
 Imports a DGN file to the document.
 (Inherited from Document.)
Import(String, DWGImportOptions, View, ElementId)
 Imports a DWG or DXF file to the document.
 (Inherited from Document.)
Import(String, ImageImportOptions, View, Element)
Imports an image (a bitmap) into the document.
 (Inherited from Document.)
Initialize
 For Revit Macros internal use only.
IsDefaultElementTypeIdValid
 Checks whether the element type id is valid for the give DefaultElmentType id.
 (Inherited from Document.)
IsDefaultFamilyTypeIdValid
 Checks whether the family type id is valid for the give family category.
 (Inherited from Document.)
IsPainted
 Checks if the element's face is painted with a material.
 (Inherited from Document.)
Link(String, DWFImportOptions)
 Links Markups in a DWF file to the document.
 (Inherited from Document.)
Link(String, SATImportOptions, View)
 Links an SAT file into the document.
 (Inherited from Document.)
Link(String, SKPImportOptions, View)
 Links an SKP file into the document.
 (Inherited from Document.)
Link(String, DGNImportOptions, View, ElementId)
 Links a DGN file to the document.
 (Inherited from Document.)
Link(String, DWGImportOptions, View, ElementId)
 Links a DWG or DXF file to the document.
 (Inherited from Document.)
LoadFamily(String)
Loads an entire family and all its types/symbols into the document.
 (Inherited from Document.)
LoadFamily(Document)
 Loads the contents of this family document into another document.
 (Inherited from Document.)
LoadFamily(String, Family)
Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
 (Inherited from Document.)
LoadFamily(Document, IFamilyLoadOptions)
 Loads the contents of this family document into another document.
 (Inherited from Document.)
LoadFamily(String, IFamilyLoadOptions, Family)
Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
 (Inherited from Document.)
LoadFamilySymbol(String, String)
Loads only a specified family type/symbol from a family file into the document.
 (Inherited from Document.)
LoadFamilySymbol(String, String, FamilySymbol)
Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
 (Inherited from Document.)
LoadFamilySymbol(String, String, IFamilyLoadOptions, FamilySymbol)
Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
 (Inherited from Document.)
MakeTransientElements
 This method encapsulates the process of creating transient elements in the document.
 (Inherited from Document.)
OnShutdownEO
 For Revit Macros internal use only.
Paint(ElementId, Face, ElementId)
 Paint the element's face with specified material.
 (Inherited from Document.)
Paint(ElementId, Face, FamilyParameter)
 Paint the element's face with specified material.
 (Inherited from Document.)
PostFailure
 Posts a failure to be displayed to the user at the end of transaction.
 (Inherited from Document.)
Print(ViewSet)
Prints a set of views with default view template and default print settings.
 (Inherited from Document.)
Print(ViewSet, View)
Prints a set of views with a specified view template and default print settings.
 (Inherited from Document.)
Print(ViewSet, Boolean)
Prints a set of views with default view template and default print settings.
 (Inherited from Document.)
Print(ViewSet, View, Boolean)
Prints a set of views with a specified view template and default print settings.
 (Inherited from Document.)
PublishCoordinates
 Publish coordinates to the specified ProjectLocation of the link instance.
 (Inherited from Document.)
Regenerate
Updates the elements in the Revit document to reflect all changes.
 (Inherited from Document.)
ReloadLatest
 Fetches changes from central (due to one or more synchronizations with central) and merges them into the current session.
 (Inherited from Document.)
RemovePaint
 Remove the material painted on the element's face. If the face is currently not painted,it will do nothing.
 (Inherited from Document.)
Save()
 Saves the document.
 (Inherited from Document.)
Save(SaveOptions)
 Saves the document.
 (Inherited from Document.)
SaveAs(String)
 Saves the document to a given file path.
 (Inherited from Document.)
SaveAs(String, SaveAsOptions)
 Saves the document to a given file path.
 (Inherited from Document.)
SaveAs(ModelPath, SaveAsOptions)
 Saves the document to a given path.
 (Inherited from Document.)
SaveToProjectAsImage
 Creates an image view from the currently active view.
 (Inherited from Document.)
SeparateElements
Separate a set of combinable elements out of combinations they currently belong to.
 (Inherited from Document.)
SetDefaultElementTypeId
 Sets the default element type id of the given DefaultElementType id.
 (Inherited from Document.)
SetDefaultFamilyTypeId
 Sets the default family type id for the given family category.
 (Inherited from Document.)
SetUnits
 Sets the units.
 (Inherited from Document.)
SynchronizeWithCentral
 Performs reload latest until the model in the current session is up to date and then saves changes back to central. A save to central is performed even if no changes were made.
 (Inherited from Document.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UnpostFailure
 Deletes the posted failure message associated with a given FailureMessageKey.
 (Inherited from Document.)
Properties
Name | Description
ActiveProjectLocation
Retrieve the active project location.
 (Inherited from Document.)
ActiveView
The document's active view.
 (Inherited from Document.)
AddinFolder
 The full path to the Revit Macros module.
Application
Returns the Application in which the Document resides.
 (Inherited from Document.)
Create
An object that can be used to create new instances of Autodesk Revit API elements within a project.
 (Inherited from Document.)
DisplayUnitSystem
Provides access to display unit type with in the document.
 (Inherited from Document.)
FamilyCreate
An object that can be used to create new instances of Autodesk Revit API elements within a family document.
 (Inherited from Document.)
FamilyManager
The family manager object provides access to family types and parameters.
 (Inherited from Document.)
IsDetached
 Identifies if a workshared document is detached. Also, see IsWorkshared
 (Inherited from Document.)
IsFamilyDocument
Identifies if the current document is a family document.
 (Inherited from Document.)
IsLinked
 Identifies if a document is a linked RVT.
 (Inherited from Document.)
IsModifiable
 The document's state of modifiability.
 (Inherited from Document.)
IsModified
 The state of changes made to the document.
 (Inherited from Document.)
IsReadOnly
 Identifies if the document is read-only or can possibly be modified.
 (Inherited from Document.)
IsReadOnlyFile
 Signals whether the document was opened from a read-only file.
 (Inherited from Document.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Document.)
IsWorkshared
 Identifies if worksharing (i.e. editing permissions and multiple worksets) have been enabled in the document. Also, see IsDetached
 (Inherited from Document.)
MassDisplayTemporaryOverride
 This setting controls temporary display in views of objects with mass category or subcategories.
 (Inherited from Document.)
MullionTypes
This property is used to retrieve all the mullion types in current system.
 (Inherited from Document.)
OwnerFamily
Get the Family of this Family Document.
 (Inherited from Document.)
PanelTypes
Retrieves a set of PanelType objects that contains all the panel types that are currently loaded into the project.
 (Inherited from Document.)
ParameterBindings
Retrieves an object from which mappings between parameter definitions and categories can be found.
 (Inherited from Document.)
PathName
 The fully qualified path of the document's disk file.
 (Inherited from Document.)
Phases
Retrieves all the object that represent phases within the project.
 (Inherited from Document.)
PlanTopologies
Get the PlanTopologies of the current project in the last phase.
 (Inherited from Document.)
PlanTopologies[Phase]
Gets the PlanTopologies of the current project in a given phase.
 (Inherited from Document.)
PlanTopology[Level]
Get the PlanTopology of a given level in the last phase.
 (Inherited from Document.)
PlanTopology[Level, Phase]
Get the PlanTopology of a given level in a given phase.
 (Inherited from Document.)
PrintManager
 Retrieve the PrintManager of current project.
 (Inherited from Document.)
ProjectInformation
Return the Project Information of the current project.
 (Inherited from Document.)
ProjectLocations
Retrieve all the project locations associated with this project
 (Inherited from Document.)
ReactionsAreUpToDate
Reports if the analytical model has regenerated in a document with reaction loads.
 (Inherited from Document.)
Settings
Provides access to general application settings, such as Categories.
 (Inherited from Document.)
SiteLocation
Returns the site location information.
 (Inherited from Document.)
Title
 The document's title.
 (Inherited from Document.)
TypeOfStorage
Get the storage type of the specified BuiltInParameter.
 (Inherited from Document.)
WorksharingCentralGUID
 The central GUID of the server-based model.
 (Inherited from Document.)
Events
Name | Description
DocumentClosing
 Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
 (Inherited from Document.)
DocumentPrinted
 Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document.
 (Inherited from Document.)
DocumentPrinting
 Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.
 (Inherited from Document.)
DocumentSaved
 Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.
 (Inherited from Document.)
DocumentSavedAs
 Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.
 (Inherited from Document.)
DocumentSaving
 Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.
 (Inherited from Document.)
DocumentSavingAs
 Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name.
 (Inherited from Document.)
ViewPrinted
 Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
 (Inherited from Document.)
ViewPrinting
 Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace